<template>
    <div class="d-flex justify-content-between">
        <h5>{{ appTableHeaderTitle }}</h5>
        <b-button pill
                  variant="outline-danger"
                  size="sm"
                  @click="$emit('close-app-table')"
        >&times; Закрити</b-button>
    </div>
</template>

<script>
    export default {
        props: ['appType'],
        data() {
            return {
                appTypesTitles: {
                    alienation_applied_phys: 'Список поданих заявок фізичними особами, вид договору: передача (відчуження)',
                    alienation_applied_jur: 'Список поданих заявок юридичними особами, вид договору: передача (відчуження)',
                    using_applied_phys: 'Список поданих заявок фізичними особами, вид договору: передача на використання',
                    using_applied_jur: 'Список поданих заявок юридичними особами, вид договору: передача на використання',

                    alienation_registered_phys: 'Список зареєстрованих заявок, поданих фізичними особами, вид договору: передача (відчуження)',
                    alienation_registered_jur: 'Список зареєстрованих заявок, поданих юридичними особами, вид договору: передача (відчуження)',
                    using_registered_phys: 'Список зареєстрованих заявок, поданих фізичними особами, вид договору: передача на використання',
                    using_registered_jur: 'Список зареєстрованих заявок, поданих юридичними особами, вид договору: передача на використання',

                    alienation_without_review_phys: 'Список заявок без розгляду, поданих фізичними особами, вид договору: передача (відчуження)',
                    alienation_without_review_jur: 'Список заявок без розгляду, поданих юридичними особами, вид договору: передача (відчуження)',
                    using_without_review_phys: 'Список заявок без розгляду, поданих фізичними особами, вид договору: передача на використання',
                    using_without_review_jur: 'Список заявок без розгляду, поданих юридичними особами, вид договору: передача на використання',

                    alienation_refusal_phys: 'Список заявок, поданих фізичними особами, яким відмовлено у розгляді, вид договору: передача (відчуження)',
                    alienation_refusal_jur: 'Список заявок, поданих юридичними особами, яким відмовлено у розгляді, вид договору: передача (відчуження)',
                    using_refusal_phys: 'Список заявок, поданих фізичними особами, яким відмовлено у розгляді, вид договору: передача на використання',
                    using_refusal_jur: 'Список заявок, поданих юридичними особами, яким відмовлено у розгляді, вид договору: передача на використання',

                    alienation_return_phys: 'Список повернених заявок, поданих фізичними особами, вид договору: передача (відчуження)',
                    alienation_return_jur: 'Список повернених заявок, поданих юридичними особами, вид договору: передача (відчуження)',
                    using_return_phys: 'Список повернених заявок, поданих фізичними особами, вид договору: передача на використання',
                    using_return_jur: 'Список повернених заявок, поданих юридичними особами, вид договору: передача на використання',
                }
            }
        },
        computed: {
            appTableHeaderTitle() {
                return this.appTypesTitles[this.appType];
            },
        }
    }
</script>

<style scoped>

</style>